package com.example.listview_028_week5

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*

class MainActivity : AppCompatActivity() {
    val titleArr = arrayOf(
        "กล้วย",
        "แตงโม",
        "มะละกอ",
        "ฝรั่ง",
        "ส้ม",
        "เงาะ",
        "มะม่วง",
        "มะเฟือง",
        "องุ่น",
        "มังคุด",
        "สับประรด",
        "แอปเปิ้ล",
        "ชมพู่",
        "แก้วมังกร",
        "ทับทิม",
        "มะพร้าว",
        "บลูเบอร์รี่",
        "ส้มโอ",
        "ลูกพีช",
        "ทุเรียน"
        )
    val detailArr = arrayOf(
        "กล้วยทุกชนิดดีต่อสุขภาพ แต่กล้วยไข่ดีเป็นพิเศษในเรื่องของสาร ต้านอนุมูลอิสระที่เรารู้จักดี",
    "แตงโมมีสารที่ว่ากันว่า ให้ความชุ่มชื้นต่อผิวที่แห้งผาก หรือผิวที่ร้อนระอุในช่วงหน้าร้อนเป็นอย่างดี และแตงโมนั้นก็ยังให้ความเย็นอยู่บนผิวของเราได้นานกว่าผลไม้ชนิดอื่น",
    "เป็นไม้ผลที่คนทั่วไปนิยมรับประทาน ผลดิบนำมาปรุงอาหารและผลสุกรับประทานสด น้ำมีรสหวานหอม มีวิตามินเอ และ แคลเซี่ยมสูง",
    "ทราบหรือไม่ว่าฝรั่ง 1 ขีด มีวิตามินซีสูงถึง 180 มิลลิกรัม วิตามิน ซีมีบทบาทในการสร้างคอลลาเจน ที่ทำให้ผิวพรรณบนใบหน้าของคุณต่งตึงไม่แก่ก่อนวัย",
    "แหล่งวิตามิน เกลือแร่ และเส้นใยธรรมชาติ การรับประทานส้มโดยไม่คายกากจะช่วยคุมน้ำหนักได้อีกวิธีหนึ่ง เพราะจะทำให้รู้สึกอิ่ม",
    "เปลือกผลเงาะนำมาต้มกินน้ำ เป็นยาแก้อักเสบ มีฤทธิ์ฆ่าเชื้อแบคทีเรียักษาอาการอักเสบในช่องปาก และโรคบิดท้องร่วง",
    "ผลรสเปรี้ยว ชุ่มเย็น ใช้บำรุงกระเพาะอาหาร แก้คลื่นไส้ อาเจียนวิงเวียน กระหายน้ำและขับปัสสาวะ ยางจากลูกและต้นผสมน้ำส้ม หรือน้ำมันแก้คัน",
    "เป็นผลไม้ ทรงรูปไข่ มีสันเป็นพูตามความยาว 3-5 เส้น เมื่อผ่าตามขวางจะเป็นรูปคล้ายดาว ผิวผลค่อนข้างเรียบเป็นมัน ผลอ่อนสีเขียว ผลสุกสีเหลือง เนื้อชุ่มน้ำ รสเปรี้ยว",
    "เป็นอาหารบำรุงร่างกายอีกชนิดหนึ่ง นอกจากจะมีคุณค่าทางอาหาร ยังมีสรรพคุณทางยาที่ดีหลายชนิด สารอาหารที่สำคัญ คือน้ำตาล และสารอาหารจำพวกกรดอินทรีย์อีกประมาณ 7-8 ชนิด",
    "สารสกัด มังคุด มีฤทธิ์ยับยั้งการเจริญเติบโตของเชื้อแบคทีเรีย อันเป็นสาเหตุอาการท้องเสีย สารที่พบมากที่เปลือกคือ tannin มีฤทธิ์ฝาดสมาน จึงช่วยแก้อาการท้องเสีย นอกจากนี้ยังมีฤทธิ์ฆ่าเชื้อแบคทีเรีย สาเหตุการเกิดหนอง และยังรักษาแผลได้อีกด้วย",
    "รักษา แผลเป็นหนองได้ โดยนำผลสดๆมาคั้นเอาแต่น้ำ ชโลมแผล เอนไซม์จะช่วยย่อยกัดเนื้อเยื่อ และหนองให้หลุด ยังใช้แก้ท้องผูกได้อีกด้วย",
    "มี สารสำคัญ คือ เบต้าแคโรทีน วิตามินซี และเส้ยใยไฟเบอร์ ชนิละลายน้ำ ที่ชื่อ เพคติน แต่ที่น่าสนใจสำคัญสำหรับผู้หญิงคือ เพคติน นี้มีคุณสมบัติช่วยลดความอยากอาหาร ลดน้ำหนัก และลดโคเลสเตอรอล",
    "รส และสรรพคุณยาไทย เอาเนื้อมาทำเป็นยาบำรุงกำลัง ทำให้เกิดความสดชื่นหอม โดยการเอาเนื้อชมพู่แห้งมาบดหรือรับประทานสดก็ได้ จะเกิดความสดชื่นขึ้นมาทันที สามารถนำมาบำรุงหัวใจได้มาก เพราะชมพู่มีกลิ่นหอมอ่อนๆ",
    "ซึ่งมีสารที่มีประโยชน์คือมิวซิเลจ(Mucilage) ที่มีลักษณะคล้ายวุ้นเจลช่วยดูดซับน้ำในร่างกาย ควบคุมระดับกลูโคสในคนที่เป็นโรคเบาหวาน",
    "มะพร้าวมีไขมันและโปรตีนมาก ผู้คนส่วนใหญ่เข้าใจว่ามะพร้าวมีบทบาทแก้ร้อนใน",
    "ประสิทธิภาพ นักวิจัยด้านเคมี Agnes Rimando จากสถาบัน U.S. Department of Agriculture กล่าวว่า สารอาหารที่ว่านี้มีชื่อว่า pterostilbene",
    "มีธาตุฟอสฟอรัส แคลเซียม มีกรดอินทรีย์ วิตามินซี เอ และบี มีธาตุแคลเซียม ฟอสฟอรัส ขับลมในกระเพาะอาหาร รสขมของส้มโอให้สารเพคตินสูงช่วยในการขจัดไขมันสะสมในร่างกาย โดยเฉพาะไขมันหน้าท้อง  ",
    "พีชเป็นผลไม้ที่มีสีเหลืองอมส้ม ซึ่งผลไม้ที่มีสีเหลืองและสีส้มจะมีวิตามินเอสูงมาก หน้าที่สำคัญของวิตามินเอ ช่วยในการควบคุมการทำงานของ Rod cells และ Cone cells ใน Retina บำรุงรักษาเซลล์ชนิดบุผิว",
    "ทุเรียนเป็นผลไม้ที่มีกลิ่นเฉพาะตัว ซึ่งเป็นส่วนผสมของสารระเหยที่ประกอบไปด้วยเอสเทอร์ คีโตน และสารประกอบกำมะถัน บางคนบอกว่าทุเรียนมีกลิ่นหอม ในขณะที่บางคนบอกว่ามีกลิ่นเหม็นรุนแรงจนถึงขั้นสะอิดสะเอียน"
    )

    val context = this

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        setTitle("ชื่อผลไม้")

        val mAdapter = ArrayAdapter(context,android.R.layout.simple_list_item_1,titleArr)

        lv_province.adapter = mAdapter
        lv_province.setOnItemClickListener{parent,view,position,id ->

            Toast.makeText(context,
                " ${titleArr[position]} " + " ${detailArr[position]}"
                , Toast.LENGTH_LONG).show()
        }
    }
}
